Revit 2024 API
RebarHostData.IsValidHost Method (Element)
 Identifies whether a given element can host reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static bool IsValidHost(
	Element element
)
Visual Basic
Public Shared Function IsValidHost ( _
	element As Element _
) As Boolean
Visual C++
public:
static bool IsValidHost(
	Element^ element
)
Parameters
element
Type: Autodesk.Revit.DB.Element
 The element to check.
Return Value
 True if the input Element can host reinforcement elements, false otherwise.
Remarks
 Many different elements are allowed to host reinforcement, for example, beams, walls, columns, or parts. Often there are specific restrictions about whether an element can host rebar beyond its type or category. For example, the material type of the element may determine this. Or for parts, the part must have been created from layers that have their role set to Structure.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarHostData Class
IsValidHost Overload
Autodesk.Revit.DB.Structure Namespace